<script setup>
import HugeBuys from "@/widgets/HugeBuys/HugeBuys.vue";
</script>

<template>
  <div class="text">
    <div class="text__container">
      <h3>Правила покупки на нашем сайте</h3>
      <p class="subHeader">
        Данные правила являются разъяснениями и не заменяют условия
        <a class="link">договора.</a>
      </p>
      <ol>
        <li>
          Наша система работает по принципу биржи: все предложения о продаже и
          покупке формируются нашими пользователями. Пользователям
          гарантированно предлагается самый выгодный из вариантов покупки и
          продажи. Система не гарантирует, что после совершения сделки не
          появится более выгодное предложение.
        </li>
        <li>
          Любой пользователь может продать любой предмет, находящийся в его
          инвентаре. Выставление предмета на продажу не приводит к потере
          предмета из инвентаря Steam, а лишь указывает на то, что вы хотите
          продать этот предмет.
        </li>
        <li>
          После оплаты покупки покупателем продавец должен будет в течение 30
          минут передать необходимый предмет в нашу систему. Если предмет
          передан, то сделка считается совершенной, если предмет не передан в
          течение 30 минут, то сделка отменяется.
        </li>
        <li>
          Система не может осуществить вывод вещи на ваш аккаунт Steam, если у
          него заблокирован обмен. Система не несёт ответственности за любые
          потери, связанные с этим.
        </li>
        <li>
          Пополнение личного счёта возможно различными платёжными системами,
          пополнение происходит моментально после оплаты соответствующего счёта
          в платёжной системе. В случае сбоя и задержки платежа более, чем на
          час, обратитесь с службу технической поддержки.
        </li>
        <li>
          Мы не можем гарантировать, что за время пополнения личного счёта
          выбранное вами предложение не исчезнет, однако в этом случае мы
          гарантируем, что средства останутся на вашем счёте и вы сможете
          выбрать другое предложение или вывести средства из системы.
        </li>
        <li>
          Для пополнения личного счёта необходимо авторизоваться на сайте и
          перейти на страницу пополнения счёта. После выбора суммы пополнения вы
          будете переадресованы на сайт платёжной системы для оплаты счёта.
        </li>
        <li>
          Вывод средств с личного счёта возможен в любой момент на доступные
          системы. Вывод неиспользованных средств возможен не ранее 7 дней с
          момента их поступления на ваш счёт в системе.
        </li>
        <li>
          В большинстве случаев вывод будет осуществлён в течение 15 минут,
          однако возможны задержки до 3 рабочих дней. Вывод неиспользованных
          средств возможен только спустя 7 дней после их зачисления на счёт.
        </li>
      </ol>
    </div>
    <HugeBuys />
  </div>
</template>

<style lang="scss" scoped>
.link {
  color: #c41341;
}
ol {
  margin-top: 20px;
  display: flex;
  flex-direction: column;
  gap: 10px;
  margin-left: 20px;
}
li {
  font-family: Geometria;
  font-size: 16px;
  font-weight: 500;
  line-height: 24px;
  text-align: left;
  color: #ffffff;
}
.text {
  @include container;

  &__container {
    display: flex;
    flex-direction: column;
    gap: 20px;

    margin: 40px auto 120px;

    max-width: 1012px;
  }
}

@media (max-width: 768px) {
  ol {
    margin-top: 0;
  }

  .text {
    &__container {
      margin: 24px auto 80px;
    }
  }
}
</style>
